import pandas as pd
data = {
    '과목번호' : ['C1', 'C2','C3','C4','C5','C6'],
    '과목명' : ['인공지능개론', '웃음치료', '경영학', '3D디자인', '스포츠경영', '예술의 세계'],
    '강의실' : ['R1', 'R2','R3', 'R4', 'R2', 'R3'],
    '시간수' : [3, 2, 3, 4, 2, 1]
}
##행선택: [2], [0:5]
##열선택: [:, 0]
df = pd.DataFrame(data)
print(df, end='\n\n')

print("111#######################################")
print(df.iloc[2], end='\n\n')

print("222#######################################")
print(df.iloc[0:5], end='\n\n')

print("333#######################################")
print(df.iloc[[0, 3, 5]], end='\n\n')

print("444#######################################")
print(df.iloc[:, 3], end='\n\n')

print("555#######################################")
print(df.iloc[:, 0:3], end='\n\n')

print("666#######################################")
print(df.iloc[:, [1,3]], end='\n\n')

print("777#######################################중요중요")
print(df.iloc[0:3, 1:3], end='\n\n')

print("888#######################################중요중요")
print(df.iloc[[1,2,5], [1,3]], end='\n\n')
